//вариант 7
#include <iostream>

using namespace std;

int main() {

    cout << "Матрица смежности:\n";
    const int N = 5;
    int mS[N][N] = {
        {0,1,1,1,0},
        {1,0,0,0,1},
        {1,0,0,1,1},
        {1,0,1,0,0},
        {0,1,1,0,0}
    };
    for (int i = 0; i < N; i++) {
        for (int j = 0; j < N; j++) {
            cout << mS[i][j] << " ";
        }
        cout << endl;
    }

    cout << "\nМатрица смежности (с вводом с клавиатуры):\n";
    int nS;
    cout << "Введите размер матрицы смежности ";
    cin >> nS;
    int mScin[nS][nS];
    cout << "Введите матрицу смежности размером " << nS << 'x' << nS << endl;
    for(int i = 0; i < N; i++)
    {
        for(int j = 0; j < N; j++)
        {
            cin >> mScin[i][j];
        }
    }
    cout << "\nМатрица смежности:\n";
    for(int i = 0; i < N; i++)
    {
        for(int j = 0; j < N; j++)
        {
            cout << mScin[i][j] << " ";
        }
        cout << endl;
    }

    const int n = 5, m = 6;
    int mInc[n][m] =
    {
        {1,1,1,0,0,0},
        {1,0,0,1,0,0},
        {0,1,0,0,1,1},
        {0,0,1,0,1,0},
        {0,0,0,1,0,1}
    };
    cout << "\nМатрица инцидентности:\n";
    cout << "    a b c d e f\n";

    for(int i = 0; i < n; i++)
    {
        cout << i + 1 << " : ";

        for(int j = 0; j < m; j++)
        {
            cout << mInc[i][j] << " ";
        }

        cout << endl;
    }

    return 0;
}

/*
 ТЕСТ
Матрица смежности:
0 1 1 1 0
1 0 0 0 1
1 0 0 1 1
1 0 1 0 0
0 1 1 0 0

Матрица смежности (с вводом с клавиатуры):
Введите размер матрицы смежности 5
Введите матрицу смежности размером 5x5
0 1 1 1 0
1 0 0 0 1
1 0 0 1 1
1 0 1 0 0
0 1 1 0 0

Матрица смежности:
0 1 1 1 0
1 0 0 0 1
1 0 0 1 1
1 0 1 0 0
0 1 1 0 0

Матрица инцидентности:
    a b c d e f
1 : 1 1 1 0 0 0
2 : 1 0 0 1 0 0
3 : 0 1 0 0 1 1
4 : 0 0 1 0 1 0
5 : 0 0 0 1 0 1
 */