#include <iostream>

using namespace std;


//const int N = 6;
const int N = 5;


// матрица смежности
//граф1
/*int sM[N][N] =
{
    {0,0,0,0,1,0},
    {0,0,1,0,1,1},
    {0,1,0,0,1,0},
    {0,0,0,0,1,0},
    {1,1,1,1,0,1},
    {0,1,0,0,1,0}
};*/

//граф2
int sM[N][N] =
{
    {0, 1, 0, 0, 1},
    {1, 0, 1, 1, 1},
    {0, 1, 0, 1, 1},
    {0, 1, 1, 0, 1},
    {1, 1, 1, 1, 0}
};

// вывод графа
void printsM()
{
    cout << "Матрица смежности:\n";
    for(int i=0; i<N; i++) {
        for(int j=0; j<N; j++) {
            cout << sM[i][j] << " ";
        }
        cout << endl;
    }
}

// Обход в глубину
void GL(int v, bool visited[]){
    visited[v] = true;
    cout << v+1 << " ";
    for(int i=0; i<N; i++) {
        if(sM[v][i] == 1 && !visited[i])
        {
            GL(i,visited);
        }
    }
}

// Обход в ширину
void SHIRINA(int v){
    bool visited[N] = {false};
    int OCH[N];

    int pn = 0; // начало очереди
    int pk = 0; // конец очереди

    OCH[pk++] = v;

    visited[v] = true;//вершина V посещена

    while(pn < pk){
        int v = OCH[pn++];

        cout << v+1 << " ";

        for(int i=0; i<N; i++){
            if(sM[v][i]==1 && !visited[i]){
                visited[i]=true;
                OCH[pk++] = i;
            }
        }
    }
}

int main()
{
    printsM();

    int start;
    cout << "\nВведите начальную вершину (1-6): ";
    cin >> start;
    start--;

    bool visited[N] = {false};

    cout << "\nОбход в глубину: ";
    GL(start, visited);

    cout << "\nОбход в ширину: ";
    SHIRINA(start);

    return 0;
}

/* ТЕСТЫ
    граф1
Матрица смежности:
0 0 0 0 1 0
0 0 1 0 1 1
0 1 0 0 1 0
0 0 0 0 1 0
1 1 1 1 0 1
0 1 0 0 1 0

Введите начальную вершину (1-6): 1

Обход в глубину: 1 5 2 3 6 4
Обход в ширину: 1 5 2 3 4 6

Матрица смежности:
0 0 0 0 1 0
0 0 1 0 1 1
0 1 0 0 1 0
0 0 0 0 1 0
1 1 1 1 0 1
0 1 0 0 1 0

Введите начальную вершину (1-6): 5

Обход в глубину: 5 1 2 3 6 4
Обход в ширину: 5 1 2 3 4 6

    граф2
Матрица смежности:
0 1 0 0 1
1 0 1 1 1
0 1 0 1 1
0 1 1 0 1
1 1 1 1 0

Введите начальную вершину (1-6): 1

Обход в глубину: 1 2 3 4 5
Обход в ширину: 1 2 5 3 4

Матрица смежности:
0 1 0 0 1
1 0 1 1 1
0 1 0 1 1
0 1 1 0 1
1 1 1 1 0

Введите начальную вершину (1-6): 4

Обход в глубину: 4 2 1 5 3
Обход в ширину: 4 2 3 5 1
 */